#განსხვავება br თეგსა და pre თეგს შორის ისაა,რომ br თეგი არის ცარიელი თეგი,ხოლო pre არის კონტეინერი თეგი
#ინდენტაცია-ერთი ტაბით,იგივე 4 სფეისით მარჯვნივ გადატანა
#nesting-ერთი ელემენტის სხვა ელემენტში მოთავსება
#ინდენტაციის დაცვა აუცილებელია შემდეგ პროგრამირების ენებში:Python - ინდენტაცია განსაზღვრავს კოდის ბლოკებს, ამიტომ აუცილებელია,
#Haskell - ხშირად იყენებს ინდენტაციას სტრუქტურირებისთვის.
#ენებში, სადაც ინდენტაციის დაცვა არ არის აუცილებელი:C - ინდენტაცია არ არის აუცილებელი, თუმცა რეკომენდებულია კოდის readability-სთვის,
#C++ - მსგავსი სიტუაცია, როგორც C-ში,
#Java - ინდენტაცია მნიშვნელოვანია წასაკითხად, მაგრამ კომპილატორი მას არ ითვალისწინებს,
#JavaScript - ინდენტაცია არ არის სავალდებულო, თუმცა მკაფიო კოდისათვის სასურველია.

#არსებობს სამი სახის ტექსტის ფორმის შემცვლელი თეგები:b , i , u.
#b - bold ეს თეგი ამუქებს მონიშნულ ინფორმაციას
#i - italic ეს თეგი მონიშნულ ინფორმაციას ხრის,აძლევს იტალიურ ფონტს
#u - underline ეს თეგი მონიშნულ ინფორმაციას ხაზავს ქვემოდან
