#არსებობს სამი მთავარი ტიპის დეველოპმენტი:front-end,back-end,full stack
#full stack შეადგენს back-end და front-end
#front-end არის ის ყველაფერი,რასაც ჩვენ ვებსაიტზე ვხედავთ
#back-end არის ის ინფორმაცია,რომელიც გვჭირდება ვებსაიტზე
#front-end-ს შეადგენს HTML(ვებსაიტის სტრუქტურა),CSS(ვებსაიტის დიზაინი) და JavaScript,Js(ვებსაიტის დავალებები).HTML და CSS არის ტექნოლოგია,JavaScript არის პროგრამირების ენა
#ელემენტისთვის შესაქმნელად აუცილებლად უნდა გამოვიყენოთ თეგი-tag
#არსებობს როგორც გამხსნელი თეგი,ასევე დამხურავი თეგიც.ელემენტს,რომელსაც გააჩნია როგორც გამხსნელი,ისე დამხურავი თეგი,ეწოდება კონტეინერ(container) თეგი,ხოლო ელემენტს,რომელსაც არ გააჩნია დამხურავი თეგი,ეწოდება ცარიელი(Empty)თეგი

