#არსებობს ორი სახის ელემენტი:კონტეინერი და ცარიელი ელემენტები
#კონტეინერი არის ისეთი სახის ელემენტი,რომელსაც გააჩნია,როგორც გამხსნელი ისე დამხურავი თეგი
#მაგალითად:<p></p> ; <button></button> და ა.შ
#ხოლო ცარიელი ელემენტი არის ისეთი სახის ელემენტი,რომელსაც გააჩნია მხოლოდ გამხსნელი თეგი
#მაგალითად"<img src="image.png">


#კომენტარი არის ტექსტი,რომლითაც ავხსნით თუ რა კოდი გვაქვს დაწერილი განსაზღვრულ ადგილას
#კომენტარები რათქმაუნდა ყველა ტექნოლოგიასა თუ ენაში სხვანაირად იწერება
#მაგ:python-ში გამოიყენება #,html-ში <!--(აქ იწერება ახსნა კოდის შესახებ)-->,javascrpt-ში გამოიყენება //
#css-ში /*(აქ იწერება ახსნა კოდის შესახებ)*/,c-ში კი გამოიყენება <(აქ იწერება ახსნა კოდის შესახებ)>
#ატრიბუტი ეს არის დამატებითი ინფორმაცია თეგის შესახებ
