#მონაცემები იყოფა ორ ნაწილად:ტექსტურ ინფორმაციად(string,str) და რიცხვებად
#ტექსტურ ინფორმაციას სჭირდება ბრჭყალები,ხოლო რიცხვებს არ სჭირდება
#რიცხვები იყოფა ორ ნაწილად:მთელ რიცხვებად(integer,int) და ათწილადებად(float)


#არსებობს ორი ტიპის გაყოფა:ჩვეულებრივი გაყოფა(/) და ნაშთიანი გაყოფა(%)
#გაყოფის დროს ტერმინალში გამოდის ის რიცხვი,რომელიც გაყოფის შედეგად მიიღო მაგ:
print(10 / 2)
#ხოლო( ნაშთიანი გაყოფის დროს ტერმინალში გამოდის ის რიცხვი,რომელიც გაყოფისას დარჩა ნაშთად მაგ:
print(10 % 3)
#როგორც ვხედავთ ტერმინალში გამოიტანა ნაშთი ერთი





print(4 + 7)
print(34 + 17)
print(10 + 110)

print(4 - 3)
print(39 - 18)
print(150 - 39)


print(3 * 6)
print(27 * 4)
print(42 * 31)


print(6 / 3)
print(120 / 40)
print(1000 / 10)


print(120 % 26)
print(100 % 30)
print(34 % 7)


print(10 ** 2)
print(25 ** 2)
print(49 ** 4)


celsius = 30
fahrenheit = (celsius * 1.8) + 30
print(fahrenheit)

დედა = 44
დედა = 64
მამა = 36
მამა = 56
და = 15
და = 35

print(დედა)
print(მამა)
print(და)